package day1115;
/*
	대입연산자
	=,
	+=, -=, *=, /=, %=
	<<=, >>=, >>>=
	&=, |=, ^=
*/

class Operator7{
	public static void main(String[] args)	{
		
		int i=3;//대입연산자 순수대입
		//산술대입
		i+=2; //i=i+2; 5
		i-=1; //i=i-1; 4
		i*=2; //i=i*2; 8
		i/=3; //i=i/2; 자바는 정수/정수 = 정수로 나옴
		i%=3; //i= i%3;

		//쉬프트 대입
		i<<=4; // i=i <<4; 0000 0010 << 4 = 0010 0000
		i>>=1; // i=i>>1; 0010 0000 >> 1= 0001 0000
//		System.out.println(i);//bug목적의 method는 개발시 확인용, 다 지워야함
		//실행중인 코드에 출력 코드가 존재하면 속도가 느려짐
		i>>>=2; //i=i>>>2; //0001 0000 >>2 = 0000 0100
		
		//비트논리 대입
		i &=12;// i= i &12; //0100 & 1100 = 0100
		i |=11; // i=i |11; //0100 | 1011 = 1111
		i ^=5; // i=i^5; // 1111^0101 = 1010
		System.out.println(i);
	}//main
}//class
